Core/src/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/src/AccumulationRegisters/РасчетыСПоставщиками/РасчетыСПоставщиками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыСПоставщиками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СодержаниеПроводки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипРасчетов</name>
    <type>
      <types>EnumRef.ТипыРасчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.РасходСоСчета</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.КорректировкаПоступления</types>
      <types>DocumentRef.ВозвратДенегОтПФ</types>
      <types>DocumentRef.ПриемИПередачаВРемонт</types>
      <types>DocumentRef.ОтчетПереработчика</types>
      <types>DocumentRef.ОтчетКомитенту</types>
      <types>DocumentRef.РасходИзКассы</types>
      <types>DocumentRef.Взаимозачет</types>
      <types>DocumentRef.ДополнительныеРасходы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/src/Documents/ЗаказПоставщику/ЗаказПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПоставщику</name>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <basedOn>Document.ЗаказНаПроизводство</basedOn>
  <basedOn>Catalog.Контрагенты</basedOn>
  <basedOn>Document.Событие</basedOn>
  <basedOn>Document.ДокументЗапроса</basedOn>
  <basedOn>Document.ВнутреннийЗаказ</basedOn>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>AccumulationRegister.ОплатаСчетовИЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ПлатежныйКалендарь</registerRecords>
  <registerRecords>AccumulationRegister.ПотребностьВЗапасах</registerRecords>
  <registerRecords>AccumulationRegister.Запасы</registerRecords>
  <registerRecords>AccumulationRegister.РазмещениеЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ГрафикДвиженияЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыПоставщикам</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантЗавершения</name>
    <type>
      <types>EnumRef.ВариантыЗавершенияЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийЗаказПоставщику</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦенКонтрагента</name>
    <type>
      <types>CatalogRef.ВидыЦенКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоступления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьКиЗГИСМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Заметки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапланироватьОплату</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>НДСВключатьВСтоимость</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоложениеДатыПоступления</name>
    <type>
      <types>EnumRef.ПоложениеРеквизитаНаФорме</types>
    </type>
  </attributes>
  <attributes>
    <name>Событие</name>
    <type>
      <types>DocumentRef.Событие</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеЗаказа</name>
    <type>
      <types>CatalogRef.СостоянияЗаказовПоставщикам</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаРезерв</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДенежныхСредств</name>
    <type>
      <types>EnumRef.ТипыДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyПроекты</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyАванс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ДокументЗапроса</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидкиНаценки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПоступления</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.Спецификации</types>
      </type>
    </attributes>
    <attributes>
      <name>ТолькоПросмотр</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>AzRyНаименованияПоставщиков</name>
      <type>
        <types>CatalogRef.AzRyНаименованияПоставщиков</types>
      </type>
    </attributes>
    <attributes>
      <name>AzRyИнфо</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>AzRyШтрихкодыНоменклатуры</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Резерв</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтгрузки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.Спецификации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПлатежныйКалендарь</name>
    <attributes>
      <name>ДатаОплаты</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентОплаты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОплаты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДСОплаты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/src/CommonForms/ФормаПодбораАвансовИДолговПоставщикам/Module.bsl
&НаКлиенте
Процедура ДобавитьИРассчитатьСтрокуАванса(СуммаРасчетов, ТекущаяСтрока)
	
	СтруктураПоиска = Новый Структура("Документ, Заказ", ТекущаяСтрока.Документ, ТекущаяСтрока.Заказ);
	Строки = СписокОтобранныеАвансыИДолги.НайтиСтроки(СтруктураПоиска);
	
	Если Строки.Количество() > 0 Тогда
		НоваяСтрока = Строки[0];
		СуммаРасчетов = СуммаРасчетов + НоваяСтрока.СуммаРасчетов;
	Иначе
		НоваяСтрока = СписокОтобранныеАвансыИДолги.Добавить();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	
	НоваяСтрока.СуммаРасчетов = СуммаРасчетов;
	
	НоваяСтрока.Курс = ?(НоваяСтрока.Курс = 0, 1, НоваяСтрока.Курс);
	НоваяСтрока.Кратность = ?(НоваяСтрока.Кратность = 0, 1, НоваяСтрока.Кратность);
	
	НоваяСтрока.Курс = ?(
		НоваяСтрока.СуммаРасчетов = 0,
		1,
		ТекущаяСтрока.СуммаУчета / ТекущаяСтрока.СуммаРасчетов * КурсВалютаУчета
	);
	
	Если НЕ УчетВалютныхОпераций Тогда
		НоваяСтрока.СуммаУчета = ТекущаяСтрока.СуммаРасчетов;
	ИначеЕсли ЗапрашиватьСумму ИЛИ Строки.Количество() > 0 Тогда
		НоваяСтрока.СуммаУчета = УправлениеНебольшойФирмойКлиент.ПересчитатьИзВалютыВВалюту(
			НоваяСтрока.СуммаРасчетов,
			НоваяСтрока.Курс,
			КурсВалютаУчета,
			НоваяСтрока.Кратность,
			КратностьВалютаУчета
		);
	КонецЕсли;
	
	Элементы.СписокОтобранныеАвансыИДолги.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
	
	РассчитатьСуммыИтог();
	
	ЗаполнитьАвансыИДолги();
	
КонецПроцедуры

// Процедура проверяет правильность заполнения реквизитов формы.
//
&НаКлиенте
Процедура ПроверитьЗаполнениеРеквизитовФормы(Отказ)
	
	// Проверка заполненности реквизитов.
	НомерСтроки = 0;
		
	Для каждого СтрокаСписокОтобранныеАвансыИДолги Из СписокОтобранныеАвансыИДолги Цикл
		НомерСтроки = НомерСтроки + 1;
		Если УчетВалютныхОпераций
		И НЕ ЗначениеЗаполнено(СтрокаСписокОтобранныеАвансыИДолги.Курс) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru='Не заполнена колонка ""Курс"" в строке ';ka='სვეტი ""კურსი"" არ არის შევსებული სტრიქონში'")
				+ Строка(НомерСтроки)
				+ НСтр("ka='სია ""გადარჩეული ავანსები და ვალები"".';ru=' списка ""Отобранные авансы и долги"".'");
			Сообщение.Поле = "Документ";
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
		Если УчетВалютныхОпераций
		И НЕ ЗначениеЗаполнено(СтрокаСписокОтобранныеАвансыИДолги.Кратность) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru='Не заполнена колонка ""Кратность"" в строке ';ka='სვეტი ""ჯერადობა"" არ არის შევსებული სტრიქონში'")
				+ Строка(НомерСтроки)
				+ НСтр("ka='სია ""გადარჩეული ავანსები და ვალები"".';ru=' списка ""Отобранные авансы и долги"".'");
			Сообщение.Поле = "Документ";
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаСписокОтобранныеАвансыИДолги.СуммаРасчетов) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru='Не заполнена колонка ""Сумма расчетов"" в строке ';ka='სვეტი ""ანგარიშსწორებების თანხა"" არ არის შევსებული სტრიქონში'")
				+ Строка(НомерСтроки)
				+ НСтр("ka='სია ""გადარჩეული ავანსები და ვალები"".';ru=' списка ""Отобранные авансы и долги"".'");
			Сообщение.Поле = "Документ";
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
		Если УчетВалютныхОпераций
		И НЕ ЗначениеЗаполнено(СтрокаСписокОтобранныеАвансыИДолги.СуммаУчета) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru='Не заполнена колонка ""Сумма учета"" в строке ';ka='სვეტი ""აღრიცხვის თანხა"" სტრიქონში არ არის შევსებული'")
				+ Строка(НомерСтроки)
				+ НСтр("ka='სია ""გადარჩეული ავანსები და ვალები"".';ru=' списка ""Отобранные авансы и долги"".'");
			Сообщение.Поле = "Документ";
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ПроверитьЗаполнениеРеквизитовФормы()

// Процедура рассчитывает итоговые суммы.
//
&НаКлиенте
Процедура РассчитатьСуммыИтог()
	
	СуммаУчетаИтог = 0;
	
	Для каждого ТекСтрока Из СписокОтобранныеАвансыИДолги Цикл
		СуммаУчетаИтог = СуммаУчетаИтог + ТекСтрока.СуммаУчета;
	КонецЦикла;
	
КонецПроцедуры // РассчитатьСуммыИтог()

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Компания = Параметры.Компания;
	Контрагент = Параметры.Контрагент;
	Период = Параметры.Дата;
	СуммаДокумента = Параметры.СуммаДокумента;
	Ссылка = Параметры.Ссылка;
	Дата = Параметры.Дата;
	УчетВалютныхОпераций = Константы.ФункциональнаяУчетВалютныхОпераций.Получить();
	
	Элементы.СписокАвансовДолговДокумент.Видимость = Контрагент.ВестиРасчетыПоДокументам;
	Элементы.СписокАвансовДолговЗаказ.Видимость = Контрагент.ВестиРасчетыПоЗаказам;
	Элементы.СписокАвансовДолговДоговор.Видимость = Контрагент.ВестиРасчетыПоДоговорам;
	Элементы.СписокОтобранныеАвансыИДолгиДокумент.Видимость = Контрагент.ВестиРасчетыПоДокументам;
	Элементы.СписокОтобранныеАвансыИДолгиЗаказ.Видимость = Контрагент.ВестиРасчетыПоЗаказам;
	Элементы.СписокОтобранныеАвансыИДолгиДоговор.Видимость = Контрагент.ВестиРасчетыПоДоговорам;
	
	АдресСписокОтобранныеАвансыИДолгиВХранилище = Параметры.АдресДебиторВХранилище;
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта", ВалютаУчета));
	КурсВалютаУчета = СтруктураПоВалюте.Курс;
	КратностьВалютаУчета = СтруктураПоВалюте.Кратность;
	
	СтрокаКолонок =
		"Договор,
		|Документ,
		|Заказ,
		|СуммаУчета,
		|Курс,
		|Кратность,
		|СуммаРасчетов,
		|ПризнакАванса";
	
	СписокОтобранныеАвансыИДолги.Загрузить(ПолучитьИзВременногоХранилища(АдресСписокОтобранныеАвансыИДолгиВХранилище));
	
	Элементы.СписокАвансовДолговСуммаУчета.Видимость = УчетВалютныхОпераций;
	
	ЗаполнитьАвансыИДолги();
	
КонецПроцедуры // ПриСозданииНаСервере()

// Процедура - обработчик события ПриОткрытии.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РассчитатьСуммыИтог();
	
КонецПроцедуры // ПриОткрытии()

// Процедура - обработчик нажатия кнопки ОК.
//
&НаКлиенте
Процедура ОК(Команда)
	
	Отказ = Ложь;
	
	ПроверитьЗаполнениеРеквизитовФормы(Отказ);
	
	Если НЕ Отказ Тогда
		ЗаписатьПодборВХранилище();
		Закрыть(КодВозвратаДиалога.OK);
	КонецЕсли;
	
КонецПроцедуры // ОК()

// Процедура - обработчик нажатия кнопки Обновить.
//
&НаКлиенте
Процедура Обновить(Команда)
	
	ЗаполнитьАвансыИДолги();
	
КонецПроцедуры // Обновить()

// Процедура - обработчик нажатия кнопки ЗапрашиватьСумму.
//
&НаКлиенте
Процедура ЗапрашиватьСумму(Команда)
	
	ЗапрашиватьСумму = НЕ ЗапрашиватьСумму;
	Элементы.ЗапрашиватьСумму.Пометка = ЗапрашиватьСумму;
	
КонецПроцедуры // ЗапрашиватьСумму()

// Процедура помещает результаты подбора в хранилище.
//
&НаСервере
Процедура ЗаписатьПодборВХранилище()
	
	СписокОтобранныеАвансыИДолгиВХранилище = СписокОтобранныеАвансыИДолги.Выгрузить(, СтрокаКолонок);
	ПоместитьВоВременноеХранилище(СписокОтобранныеАвансыИДолгиВХранилище, АдресСписокОтобранныеАвансыИДолгиВХранилище);
	
КонецПроцедуры // ЗаписатьПодборВХранилище()

// Получает набор данных с сервера для процедуры СписокОтобранныеАвансыИДолгиДокументПриИзменении.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеДокументПриИзменении(Документ)
	
	СтруктураДанные = Новый Структура();
	
	СтруктураДанные.Вставить("СуммаРасчетов", Документ.РасшифровкаПлатежа.Итог("СуммаРасчетов"));
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеДокументПриИзменении()

// Добавляет строку в отобранные.
//
&НаКлиенте
Процедура ДобавитьСтрокуВОтобранные(ТекущаяСтрока)
	
	СуммаРасчетов = ТекущаяСтрока.СуммаРасчетов;
	Если ЗапрашиватьСумму Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьФормуЦеныИВалютаЗавершение", ЭтотОбъект, Новый Структура("ТекущаяСтрока, СуммаРасчетов", ТекущаяСтрока, СуммаРасчетов));
		ПоказатьВводЧисла(ОписаниеОповещения, СуммаРасчетов, НСтр("ka='შეიყვანეთ ანგარიშსწორებების თანხა';ru='Введите сумму расчетов';en='Enter the amount of calculations'"));
		
	Иначе
		
		ДобавитьИРассчитатьСтрокуАванса(СуммаРасчетов, ТекущаяСтрока);
		
	КонецЕсли;
	
КонецПроцедуры // ДобавитьСтрокуВОтобранные()

// Процедура помещает результаты выбора в подбор.
//
&НаКлиенте
Процедура СписокАвансовВыборЗначения(Элемент, СтандартнаяОбработка, Значение)
	
	СтандартнаяОбработка = Ложь;
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	ДобавитьСтрокуВОтобранные(ТекущаяСтрока);
	
КонецПроцедуры // СписокАвансовВыборЗначения()

// Процедура - обработчик события ПриНачалеРедактирования табличной части СписокОтобранныеАвансыИДолги.
//
&НаКлиенте
Процедура СписокОтобранныеАвансыИДолгиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Копирование Тогда
		РассчитатьСуммыИтог();
		ЗаполнитьАвансыИДолги();
	КонецЕсли;
	
КонецПроцедуры // СписокОтобранныеАвансыИДолгиПриНачалеРедактирования()

// Процедура - обработчик события ПриИзменении поля ввода СуммаРасчетов табличной части
// СписокОтобранныеАвансыИДолги. Расчитывает сумму платежа.
//
&НаКлиенте
Процедура СписокОтобранныеАвансыИДолгиСуммаРасчетовПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.СписокОтобранныеАвансыИДолги.ТекущиеДанные;
	РассчитатьСуммуУчета(СтрокаТабличнойЧасти);
	
КонецПроцедуры // СписокОтобранныеАвансыИДолгиСуммаРасчетовПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода Курс табличной части
// СписокОтобранныеАвансыИДолги. Расчитывает сумму платежа.
//
&НаКлиенте
Процедура СписокОтобранныеАвансыИДолгиКурсПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.СписокОтобранныеАвансыИДолги.ТекущиеДанные;
	РассчитатьСуммуУчета(СтрокаТабличнойЧасти);
	
КонецПроцедуры // СписокОтобранныеАвансыИДолгиКурсПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода Кратность табличной части
// СписокОтобранныеАвансыИДолги. Расчитывает сумму платежа.
//
&НаКлиенте
Процедура СписокОтобранныеАвансыИДолгиКратностьПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.СписокОтобранныеАвансыИДолги.ТекущиеДанные;
	РассчитатьСуммуУчета(СтрокаТабличнойЧасти);
	
КонецПроцедуры // СписокОтобранныеАвансыИДолгиКратностьПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода СуммаУчета табличной части
// СписокОтобранныеАвансыИДолги. Расчитывает курс и кратность.
//
&НаКлиенте
Процедура СписокОтобранныеАвансыИДолгиСуммаУчетаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.СписокОтобранныеАвансыИДолги.ТекущиеДанные;
	
	СтрокаТабличнойЧасти.Курс = ?(
		СтрокаТабличнойЧасти.Курс = 0,
		1,
		СтрокаТабличнойЧасти.Курс
	);
	
	СтрокаТабличнойЧасти.Кратность = 1;
	
	СтрокаТабличнойЧасти.Курс =
		?(СтрокаТабличнойЧасти.СуммаРасчетов = 0,
			1,
			СтрокаТабличнойЧасти.СуммаУчета
		  / СтрокаТабличнойЧасти.СуммаРасчетов
		  * КурсВалютаУчета
	);
	
КонецПроцедуры // СписокОтобранныеАвансыИДолгиСуммаПлатежаПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода Документ табличной части
// СписокОтобранныеАвансыИДолги.
//
&НаКлиенте
Процедура СписокОтобранныеАвансыИДолгиДокументПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.СписокОтобранныеАвансыИДолги.ТекущиеДанные;
	
	Если ТипЗнч(СтрокаТабличнойЧасти.Документ) = Тип("ДокументСсылка.РасходИзКассы")
	 ИЛИ ТипЗнч(СтрокаТабличнойЧасти.Документ) = Тип("ДокументСсылка.РасходСоСчета") Тогда
		СтрокаТабличнойЧасти.ПризнакАванса = Истина;
	Иначе
		СтрокаТабличнойЧасти.ПризнакАванса = Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Документ) Тогда
		СтруктураДанные = ПолучитьДанныеДокументПриИзменении(СтрокаТабличнойЧасти.Документ);
		СтрокаТабличнойЧасти.СуммаРасчетов = СтруктураДанные.СуммаРасчетов;
		РассчитатьСуммуУчета(СтрокаТабличнойЧасти);
	КонецЕсли;
	
КонецПроцедуры // СписокОтобранныеАвансыИДолгиДокументПриИзменении()

// Процедура - обработчик события НачалоПеретаскивания списка СписокАвансов.
//
&НаКлиенте
Процедура СписокАвансовНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Структура = Новый Структура;
	Структура.Вставить("Договор", ТекущиеДанные.Договор);
	Структура.Вставить("Документ", ТекущиеДанные.Документ);
	Структура.Вставить("Заказ", ТекущиеДанные.Заказ);
	Структура.Вставить("СуммаРасчетов", ТекущиеДанные.СуммаРасчетов);
	Структура.Вставить("ПризнакАванса", ТекущиеДанные.ПризнакАванса);
	
	Если ТекущиеДанные.Свойство("СуммаУчета") Тогда
		Структура.Вставить("СуммаУчета", ТекущиеДанные.СуммаУчета);
	КонецЕсли;
	
	ПараметрыПеретаскивания.Значение = Структура;
	
	ПараметрыПеретаскивания.ДопустимыеДействия = ДопустимыеДействияПеретаскивания.Копирование;
	
КонецПроцедуры // СписокАвансовНачалоПеретаскивания()

// Процедура - обработчик события ПроверкаПеретаскивания списка СписокОтобранныеАвансыИДолги.
//
&НаКлиенте
Процедура СписокОтобранныеАвансыИДолгиПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Копирование;
	
КонецПроцедуры // СписокОтобранныеАвансыИДолгиПроверкаПеретаскивания()

// Процедура - обработчик события Перетаскивание списка СписокОтобранныеАвансыИДолги.
//
&НаКлиенте
Процедура СписокОтобранныеАвансыИДолгиПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	ТекущаяСтрока = ПараметрыПеретаскивания.Значение;
	ДобавитьСтрокуВОтобранные(ТекущаяСтрока);
	ЗаполнитьАвансыИДолги();
	
КонецПроцедуры // СписокОтобранныеАвансыИДолгиПеретаскивание()

// Процедура - обработчик события ПриИзменении списка СписокОтобранныеАвансыИДолги.
//
&НаКлиенте
Процедура СписокОтобранныеАвансыИДолгиПриИзменении(Элемент)
	
	РассчитатьСуммыИтог();
	ЗаполнитьАвансыИДолги();
	
КонецПроцедуры // СписокОтобранныеАвансыИДолгиПриИзменении()

// Процедура - обработчик события ПриИзменении списка СписокОтобранныеАвансыИДолгиДоговор.
//
&НаКлиенте
Процедура СписокОтобранныеАвансыИДолгиДоговорПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.СписокОтобранныеАвансыИДолги.ТекущиеДанные;
	
	СтруктураДанные = ПолучитьДанныеДоговорПриИзменении(
		Дата,
		СтрокаТабличнойЧасти.Договор
	);
	
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Договор) Тогда 
		СтрокаТабличнойЧасти.Курс      = ?(СтруктураДанные.ВалютаКурсКратность.Курс = 0, 1, СтруктураДанные.ВалютаКурсКратность.Курс);
		СтрокаТабличнойЧасти.Кратность = ?(СтруктураДанные.ВалютаКурсКратность.Кратность = 0, 1, СтруктураДанные.ВалютаКурсКратность.Кратность);
	КонецЕсли;
	
	РассчитатьСуммуУчета(СтрокаТабличнойЧасти);
	
КонецПроцедуры // СписокОтобранныеАвансыИДолгиДоговорПриИзменении()

// Процедура расчитывает сумму учета.
//
&НаКлиенте
Процедура РассчитатьСуммуУчета(СтрокаТабличнойЧасти)
	
	СтрокаТабличнойЧасти.Курс      = ?(СтрокаТабличнойЧасти.Курс      = 0, 1, СтрокаТабличнойЧасти.Курс);
	СтрокаТабличнойЧасти.Кратность = ?(СтрокаТабличнойЧасти.Кратность = 0, 1, СтрокаТабличнойЧасти.Кратность);
	
	СтрокаТабличнойЧасти.СуммаУчета = УправлениеНебольшойФирмойКлиент.ПересчитатьИзВалютыВВалюту(
		СтрокаТабличнойЧасти.СуммаРасчетов,
		СтрокаТабличнойЧасти.Курс,
		КурсВалютаУчета,
		СтрокаТабличнойЧасти.Кратность,
		КратностьВалютаУчета
	);
	
КонецПроцедуры // РассчитатьСуммуУчета()

// Получает набор данных с сервера для процедуры ВалютаДенежныхСредствПриИзменении.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеДоговорПриИзменении(Дата, Договор)
	
	СтруктураДанные = Новый Структура();
	
	СтруктураДанные.Вставить(
		"ВалютаКурсКратность",
		РегистрыСведений.КурсыВалют.ПолучитьПоследнее(
			Дата,
			Новый Структура("Валюта", Договор.ВалютаРасчетов)
		)
	);
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеДоговорПриИзменении()

// Процедура заполняет список авансов.
//
&НаСервере
Процедура ЗаполнитьАвансыИДолги()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтобранныеАвансыИДолги.ПризнакАванса,
	|	ОтобранныеАвансыИДолги.Договор,
	|	ОтобранныеАвансыИДолги.Документ,
	|	ВЫБОР
	|		КОГДА ОтобранныеАвансыИДолги.Заказ = НЕОПРЕДЕЛЕНО
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|		ИНАЧЕ ОтобранныеАвансыИДолги.Заказ
	|	КОНЕЦ КАК Заказ,
	|	ОтобранныеАвансыИДолги.СуммаРасчетов,
	|	ОтобранныеАвансыИДолги.СуммаУчета
	|ПОМЕСТИТЬ ТаблицаОтобранныеАвансыИДолги
	|ИЗ
	|	&ТаблицаОтобранныеАвансыИДолги КАК ОтобранныеАвансыИДолги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетыСПоставщикамиОстатки.Документ КАК Документ,
	|	РасчетыСПоставщикамиОстатки.Договор КАК Договор,
	|	РасчетыСПоставщикамиОстатки.Заказ КАК Заказ,
	|	РасчетыСПоставщикамиОстатки.ПризнакАванса КАК ПризнакАванса,
	|	СУММА(РасчетыСПоставщикамиОстатки.СуммаОстаток) КАК СуммаУчета,
	|	СУММА(РасчетыСПоставщикамиОстатки.СуммаВалОстаток) КАК СуммаРасчетов,
	|	РасчетыСПоставщикамиОстатки.Документ.Дата КАК ДокументДата,
	|	КурсыВалютРасчетов.Курс КАК Курс,
	|	КурсыВалютРасчетов.Кратность КАК Кратность
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыСПоставщикамиОстатки.Договор КАК Договор,
	|		РасчетыСПоставщикамиОстатки.Документ КАК Документ,
	|		РасчетыСПоставщикамиОстатки.Заказ КАК Заказ,
	|		ВЫБОР
	|			КОГДА РасчетыСПоставщикамиОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ КАК ПризнакАванса,
	|		ВЫБОР
	|			КОГДА РасчетыСПоставщикамиОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|				ТОГДА -РасчетыСПоставщикамиОстатки.СуммаОстаток
	|			ИНАЧЕ РасчетыСПоставщикамиОстатки.СуммаОстаток
	|		КОНЕЦ КАК СуммаОстаток,
	|		ВЫБОР
	|			КОГДА РасчетыСПоставщикамиОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|				ТОГДА -РасчетыСПоставщикамиОстатки.СуммаВалОстаток
	|			ИНАЧЕ РасчетыСПоставщикамиОстатки.СуммаВалОстаток
	|		КОНЕЦ КАК СуммаВалОстаток
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщиками.Остатки(
	|				,
	|				Организация = &Организация
	|					И Контрагент = &Контрагент) КАК РасчетыСПоставщикамиОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОтобранныеАвансыИДолги.Договор,
	|		ОтобранныеАвансыИДолги.Документ,
	|		ОтобранныеАвансыИДолги.Заказ,
	|		ОтобранныеАвансыИДолги.ПризнакАванса,
	|		-ОтобранныеАвансыИДолги.СуммаУчета,
	|		-ОтобранныеАвансыИДолги.СуммаРасчетов
	|	ИЗ
	|		ТаблицаОтобранныеАвансыИДолги КАК ОтобранныеАвансыИДолги
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияДокументаРасчетыСПоставщиками.Договор,
	|		ДвиженияДокументаРасчетыСПоставщиками.Документ,
	|		ДвиженияДокументаРасчетыСПоставщиками.Заказ,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаРасчетыСПоставщиками.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаРасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ЕСТЬNULL(ДвиженияДокументаРасчетыСПоставщиками.Сумма, 0)
	|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаРасчетыСПоставщиками.Сумма, 0)
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаРасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ЕСТЬNULL(ДвиженияДокументаРасчетыСПоставщиками.СуммаВал, 0)
	|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаРасчетыСПоставщиками.СуммаВал, 0)
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщиками КАК ДвиженияДокументаРасчетыСПоставщиками
	|	ГДЕ
	|		ДвиженияДокументаРасчетыСПоставщиками.Регистратор = &Ссылка
	|		И ДвиженияДокументаРасчетыСПоставщиками.Период <= &Период
	|		И ДвиженияДокументаРасчетыСПоставщиками.Организация = &Организация
	|		И ДвиженияДокументаРасчетыСПоставщиками.Контрагент = &Контрагент) КАК РасчетыСПоставщикамиОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, ) КАК КурсыВалютРасчетов
	|		ПО РасчетыСПоставщикамиОстатки.Договор.ВалютаРасчетов = КурсыВалютРасчетов.Валюта
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСПоставщикамиОстатки.Документ,
	|	РасчетыСПоставщикамиОстатки.Договор,
	|	РасчетыСПоставщикамиОстатки.Заказ,
	|	РасчетыСПоставщикамиОстатки.ПризнакАванса,
	|	РасчетыСПоставщикамиОстатки.Документ.Дата,
	|	КурсыВалютРасчетов.Курс,
	|	КурсыВалютРасчетов.Кратность
	|
	|ИМЕЮЩИЕ
	|	(СУММА(РасчетыСПоставщикамиОстатки.СуммаОстаток) > 0
	|		ИЛИ СУММА(РасчетыСПоставщикамиОстатки.СуммаВалОстаток) > 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументДата";
	
	Запрос.УстановитьПараметр("Организация", Компания);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ТаблицаОтобранныеАвансыИДолги", СписокОтобранныеАвансыИДолги.Выгрузить());
	
	СписокАвансовДолгов.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры // ЗаполнитьАвансыИДолги()

#Область ОбработчикиРезультатовИнтерактивныхДействий

&НаКлиенте
// Процедура-обработчик результата ввода суммы зачета аванса поставщика
//
Процедура ОткрытьФормуЦеныИВалютаЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СуммаРасчетов = РезультатЗакрытия;
	ТекущаяСтрока = ДополнительныеПараметры.ТекущаяСтрока;
	
	ДобавитьИРассчитатьСтрокуАванса(СуммаРасчетов, ТекущаяСтрока);	
	
КонецПроцедуры // ОткрытьФормуЦеныИВалютаЗавершение()

#КонецОбласти

//&НаСервере
//Процедура ЗаполнитьРасшифровкуПлатежа()
//	
//	// Заполнение расшифровки расчетов по умолчанию.
//	апрос = Новый Запрос;
//	Запрос.Текст =
//	
//	"ВЫБРАТЬ
//	|	РасчетыСПоставщикамиОстатки.Организация КАК Организация,
//	|	РасчетыСПоставщикамиОстатки.Договор КАК Договор,
//	|	РасчетыСПоставщикамиОстатки.Документ КАК Документ,
//	|	РасчетыСПоставщикамиОстатки.Заказ КАК Заказ,
//	|	РасчетыСПоставщикамиОстатки.ТипРасчетов КАК ТипРасчетов,
//	|	СУММА(РасчетыСПоставщикамиОстатки.СуммаОстаток) КАК СуммаУчета,
//	|	СУММА(РасчетыСПоставщикамиОстатки.СуммаВалОстаток) КАК СуммаРасчетов,
//	|	РасчетыСПоставщикамиОстатки.Документ.Дата КАК ДокументДата,
//	|	СУММА(ВЫРАЗИТЬ(РасчетыСПоставщикамиОстатки.СуммаВалОстаток * КурсыВалютРасчетов.Курс * КурсыВалютДокумента.Кратность / (КурсыВалютДокумента.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2))) КАК СуммаВалДокумента,
//	|	КурсыВалютДокумента.Курс КАК КурсДенежныхСредств,
//	|	КурсыВалютДокумента.Кратность КАК КратностьДенежныхСредств,
//	|	КурсыВалютРасчетов.Курс КАК Курс,
//	|	КурсыВалютРасчетов.Кратность КАК Кратность
//	|ИЗ
//	|	(ВЫБРАТЬ
//	|		РасчетыСПоставщикамиОстатки.Организация КАК Организация,
//	|		РасчетыСПоставщикамиОстатки.Договор КАК Договор,
//	|		РасчетыСПоставщикамиОстатки.Документ КАК Документ,
//	|		РасчетыСПоставщикамиОстатки.Заказ КАК Заказ,
//	|		РасчетыСПоставщикамиОстатки.ТипРасчетов КАК ТипРасчетов,
//	|		ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
//	|		ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаВалОстаток, 0) КАК СуммаВалОстаток
//	|	ИЗ
//	|		РегистрНакопления.РасчетыСПоставщиками.Остатки(
//	|				,
//	|				Организация = &Организация
//	|					И Контрагент = &Контрагент
//	|					И ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)) КАК РасчетыСПоставщикамиОстатки
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|	
//	|	ВЫБРАТЬ
//	|		ДвиженияДокументаРасчетыСПоставщиками.Организация,
//	|		ДвиженияДокументаРасчетыСПоставщиками.Договор,
//	|		ДвиженияДокументаРасчетыСПоставщиками.Документ,
//	|		ДвиженияДокументаРасчетыСПоставщиками.Заказ,
//	|		ДвиженияДокументаРасчетыСПоставщиками.ТипРасчетов,
//	|		ВЫБОР
//	|			КОГДА ДвиженияДокументаРасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
//	|				ТОГДА -ЕСТЬNULL(ДвиженияДокументаРасчетыСПоставщиками.Сумма, 0)
//	|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаРасчетыСПоставщиками.Сумма, 0)
//	|		КОНЕЦ,
//	|		ВЫБОР
//	|			КОГДА ДвиженияДокументаРасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
//	|				ТОГДА -ЕСТЬNULL(ДвиженияДокументаРасчетыСПоставщиками.СуммаВал, 0)
//	|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаРасчетыСПоставщиками.СуммаВал, 0)
//	|		КОНЕЦ
//	|	ИЗ
//	|		РегистрНакопления.РасчетыСПоставщиками КАК ДвиженияДокументаРасчетыСПоставщиками
//	|	ГДЕ
//	|		ДвиженияДокументаРасчетыСПоставщиками.Регистратор = &Ссылка
//	|		И ДвиженияДокументаРасчетыСПоставщиками.Период <= &Период
//	|		И ДвиженияДокументаРасчетыСПоставщиками.Организация = &Организация
//	|		И ДвиженияДокументаРасчетыСПоставщиками.Контрагент = &Контрагент
//	|		И ДвиженияДокументаРасчетыСПоставщиками.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)) КАК РасчетыСПоставщикамиОстатки
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, ) КАК КурсыВалютДокумента
//	|		ПО (ИСТИНА)
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, ) КАК КурсыВалютРасчетов
//	|		ПО РасчетыСПоставщикамиОстатки.Договор.ВалютаРасчетов = КурсыВалютРасчетов.Валюта
//	|ГДЕ
//	|	РасчетыСПоставщикамиОстатки.СуммаВалОстаток > 0
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	РасчетыСПоставщикамиОстатки.Организация,
//	|	РасчетыСПоставщикамиОстатки.Договор,
//	|	РасчетыСПоставщикамиОстатки.Документ,
//	|	РасчетыСПоставщикамиОстатки.Заказ,
//	|	РасчетыСПоставщикамиОстатки.ТипРасчетов,
//	|	РасчетыСПоставщикамиОстатки.Документ.Дата,
//	|	КурсыВалютДокумента.Курс,
//	|	КурсыВалютДокумента.Кратность,
//	|	КурсыВалютРасчетов.Курс,
//	|	КурсыВалютРасчетов.Кратность
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	ДокументДата";
//		
//	Запрос.УстановитьПараметр("Организация", Компания);
//	Запрос.УстановитьПараметр("Контрагент", Контрагент);
//	Запрос.УстановитьПараметр("Период", Период);
//	//Запрос.УстановитьПараметр("Валюта", ВалютаДенежныхСредств);
//	Запрос.УстановитьПараметр("Ссылка", Ссылка);
//	
//	НуженОтборПоДоговорам = УправлениеНебольшойФирмойПовтИсп.ТребуетсяКонтрольДоговоровКонтрагентов();
//	//СписокВидовДоговоров = Справочники.ДоговорыКонтрагентов.ПолучитьСписокВидовДоговораДляДокумента(Ссылка, ВидОперации);
//	//Если Контрагент.ВестиРасчетыПоДоговорам
//	//   И НуженОтборПоДоговорам Тогда
//	//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "// ТекстДоговорОтбор", "И Договор.ВидДоговора В (&СписокВидовДоговоров)");
//	//	Запрос.УстановитьПараметр("СписокВидовДоговоров", СписокВидовДоговоров);
//	//КонецЕсли;
//	
//	ДоговорПоУмолчанию = Справочники.ДоговорыКонтрагентов.ПолучитьДоговорПоУмолчаниюПоОрганизацииВидуДоговора(
//		Контрагент,
//		Компания,
//		//СписокВидовДоговоров
//	);
//	
//	СтруктураКурсВалютыДоговораПоУмолчанию = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(
//		Период,
//		Новый Структура("Валюта", ДоговорПоУмолчанию.ВалютаРасчетов)
//	);
//	
//	ВыборкаРезультатаЗапроса = Запрос.Выполнить().Выбрать();
//	
//	СписокОтобранныеАвансыИДолги.Очистить();
//	
//	СуммаОсталосьРаспределить = СуммаДокумента;
//	
//	//СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Период, Новый Структура("Валюта", ВалютаДенежныхСредств));
//	//
//	//Курс = ?(
//	//	СтруктураПоВалюте.Курс = 0,
//	//	1,
//	//	СтруктураПоВалюте.Курс
//	//);
//	//Кратность = ?(
//	//	СтруктураПоВалюте.Курс = 0,
//	//	1,
//	//	СтруктураПоВалюте.Кратность
//	//);
//	
//	Пока СуммаОсталосьРаспределить > 0 Цикл
//		
//		НоваяСтрока = СписокОтобранныеАвансыИДолги.Добавить();
//		
//		Если ВыборкаРезультатаЗапроса.Следующий() Тогда
//			
//			//ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаРезультатаЗапроса);
//			
//			Если ВыборкаРезультатаЗапроса.СуммаВалДокумента <= СуммаОсталосьРаспределить Тогда // сумма остатка меньше или равна чем осталось распределить
//				
//				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаРезультатаЗапроса);

//				СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ВыборкаРезультатаЗапроса.ДокументДата, Новый Структура("Валюта", ВыборкаРезультатаЗапроса.Договор.ВалютаРасчетов));

//				Курс = ?(СтруктураПоВалюте.Курс = 0,1,СтруктураПоВалюте.Курс);
//				Кратность = ?(СтруктураПоВалюте.Курс = 0,1,СтруктураПоВалюте.Кратность);
//				
//				//НоваяСтрока.СуммаРасчетов = ВыборкаРезультатаЗапроса.СуммаВалОстаток;
//				НоваяСтрока.СуммаРасчетов = ВыборкаРезультатаЗапроса.СуммаРасчетов;
//				СуммаОсталосьРаспределить = СуммаОсталосьРаспределить - ВыборкаРезультатаЗапроса.СуммаВалДокумента;
//				
//			Иначе // сумма остатка больше чем нужно распределить
//				
//				НоваяСтрока.СуммаРасчетов = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(
//					СуммаОсталосьРаспределить,
//					ВыборкаРезультатаЗапроса.КурсДенежныхСредств,
//					ВыборкаРезультатаЗапроса.Курс,
//					ВыборкаРезультатаЗапроса.КратностьДенежныхСредств,
//					ВыборкаРезультатаЗапроса.Кратность
//				);
//				СуммаОсталосьРаспределить = 0;
//				
//			КонецЕсли;
//			
//		Иначе
//			
//			НоваяСтрока.Договор = ДоговорПоУмолчанию;
//			НоваяСтрока.Курс = ?(
//				СтруктураКурсВалютыДоговораПоУмолчанию.Курс = 0,
//				1,
//				СтруктураКурсВалютыДоговораПоУмолчанию.Курс
//			);
//			НоваяСтрока.Кратность = ?(
//				СтруктураКурсВалютыДоговораПоУмолчанию.Кратность = 0,
//				1,
//				СтруктураКурсВалютыДоговораПоУмолчанию.Кратность
//			);
//			НоваяСтрока.СуммаРасчетов = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(
//				СуммаОсталосьРаспределить,
//				Курс,
//				НоваяСтрока.Курс,
//				Кратность,
//				НоваяСтрока.Кратность
//			);
//			НоваяСтрока.ПризнакАванса = Истина;
//			СуммаОсталосьРаспределить = 0;
//			
//		КонецЕсли;
//		
//	КонецЦикла;
//	
//КонецПроцедуры // ЗаполнитьРасшифровкуПлатежа()

&НаСервере
Процедура ЗаполнитьРасшифровкуПлатежа()
	
	СписокОтобранныеАвансыИДолги.Очистить();
		
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтобранныеАвансыИДолги.ПризнакАванса КАК ПризнакАванса,
	|	ОтобранныеАвансыИДолги.Договор КАК Договор,
	|	ОтобранныеАвансыИДолги.Документ КАК Документ,
	|	ВЫБОР
	|		КОГДА ОтобранныеАвансыИДолги.Заказ = НЕОПРЕДЕЛЕНО
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|		ИНАЧЕ ОтобранныеАвансыИДолги.Заказ
	|	КОНЕЦ КАК Заказ,
	|	ОтобранныеАвансыИДолги.СуммаРасчетов КАК СуммаРасчетов,
	|	ОтобранныеАвансыИДолги.СуммаУчета КАК СуммаУчета
	|ПОМЕСТИТЬ ТаблицаОтобранныеАвансыИДолги
	|ИЗ
	|	&ТаблицаОтобранныеАвансыИДолги КАК ОтобранныеАвансыИДолги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетыСПоставщикамиОстатки.Документ КАК Документ,
	|	РасчетыСПоставщикамиОстатки.Договор КАК Договор,
	|	РасчетыСПоставщикамиОстатки.Заказ КАК Заказ,
	|	РасчетыСПоставщикамиОстатки.ПризнакАванса КАК ПризнакАванса,
	|	СУММА(РасчетыСПоставщикамиОстатки.СуммаОстаток) КАК СуммаУчета,
	|	СУММА(РасчетыСПоставщикамиОстатки.СуммаВалОстаток) КАК СуммаРасчетов,
	|	РасчетыСПоставщикамиОстатки.Документ.Дата КАК ДокументДата,
	|	КурсыВалютРасчетов.Курс КАК Курс,
	|	КурсыВалютРасчетов.Кратность КАК Кратность
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыСПоставщикамиОстатки.Договор КАК Договор,
	|		РасчетыСПоставщикамиОстатки.Документ КАК Документ,
	|		РасчетыСПоставщикамиОстатки.Заказ КАК Заказ,
	|		ВЫБОР
	|			КОГДА РасчетыСПоставщикамиОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ КАК ПризнакАванса,
	|		ВЫБОР
	|			КОГДА РасчетыСПоставщикамиОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|				ТОГДА -РасчетыСПоставщикамиОстатки.СуммаОстаток
	|			ИНАЧЕ РасчетыСПоставщикамиОстатки.СуммаОстаток
	|		КОНЕЦ КАК СуммаОстаток,
	|		ВЫБОР
	|			КОГДА РасчетыСПоставщикамиОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|				ТОГДА -РасчетыСПоставщикамиОстатки.СуммаВалОстаток
	|			ИНАЧЕ РасчетыСПоставщикамиОстатки.СуммаВалОстаток
	|		КОНЕЦ КАК СуммаВалОстаток
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщиками.Остатки(
	|				,
	|				Организация = &Организация
	|					И Контрагент = &Контрагент) КАК РасчетыСПоставщикамиОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОтобранныеАвансыИДолги.Договор,
	|		ОтобранныеАвансыИДолги.Документ,
	|		ОтобранныеАвансыИДолги.Заказ,
	|		ОтобранныеАвансыИДолги.ПризнакАванса,
	|		-ОтобранныеАвансыИДолги.СуммаУчета,
	|		-ОтобранныеАвансыИДолги.СуммаРасчетов
	|	ИЗ
	|		ТаблицаОтобранныеАвансыИДолги КАК ОтобранныеАвансыИДолги
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияДокументаРасчетыСПоставщиками.Договор,
	|		ДвиженияДокументаРасчетыСПоставщиками.Документ,
	|		ДвиженияДокументаРасчетыСПоставщиками.Заказ,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаРасчетыСПоставщиками.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаРасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ЕСТЬNULL(ДвиженияДокументаРасчетыСПоставщиками.Сумма, 0)
	|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаРасчетыСПоставщиками.Сумма, 0)
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаРасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ЕСТЬNULL(ДвиженияДокументаРасчетыСПоставщиками.СуммаВал, 0)
	|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаРасчетыСПоставщиками.СуммаВал, 0)
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщиками КАК ДвиженияДокументаРасчетыСПоставщиками
	|	ГДЕ
	|		ДвиженияДокументаРасчетыСПоставщиками.Регистратор = &Ссылка
	|		И ДвиженияДокументаРасчетыСПоставщиками.Период <= &Период
	|		И ДвиженияДокументаРасчетыСПоставщиками.Организация = &Организация
	|		И ДвиженияДокументаРасчетыСПоставщиками.Контрагент = &Контрагент) КАК РасчетыСПоставщикамиОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, ) КАК КурсыВалютРасчетов
	|		ПО РасчетыСПоставщикамиОстатки.Договор.ВалютаРасчетов = КурсыВалютРасчетов.Валюта
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСПоставщикамиОстатки.Документ,
	|	РасчетыСПоставщикамиОстатки.Договор,
	|	РасчетыСПоставщикамиОстатки.Заказ,
	|	РасчетыСПоставщикамиОстатки.ПризнакАванса,
	|	РасчетыСПоставщикамиОстатки.Документ.Дата,
	|	КурсыВалютРасчетов.Курс,
	|	КурсыВалютРасчетов.Кратность
	|
	|ИМЕЮЩИЕ
	|	(СУММА(РасчетыСПоставщикамиОстатки.СуммаОстаток) > 0
	|		ИЛИ СУММА(РасчетыСПоставщикамиОстатки.СуммаВалОстаток) > 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументДата";
	
	Запрос.УстановитьПараметр("Организация", Компания);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ТаблицаОтобранныеАвансыИДолги", СписокОтобранныеАвансыИДолги.Выгрузить());
	
		
	НуженОтборПоДоговорам = УправлениеНебольшойФирмойПовтИсп.ТребуетсяКонтрольДоговоровКонтрагентов();
	
	ДоговорПоУмолчанию = Справочники.ДоговорыКонтрагентов.ПолучитьДоговорПоУмолчаниюПоОрганизацииВидуДоговора(
		Контрагент,
		Компания,);
	
	СтруктураКурсВалютыДоговораПоУмолчанию = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(
		Дата,
		Новый Структура("Валюта", ДоговорПоУмолчанию.ВалютаРасчетов)
	);
	
	ВыборкаРезультатаЗапроса = Запрос.Выполнить().Выбрать();
	
	СписокОтобранныеАвансыИДолги.Очистить();
	
	СуммаОсталосьРаспределить = СуммаДокумента;
	
	
	Пока СуммаОсталосьРаспределить > 0 Цикл
		
		НоваяСтрока = СписокОтобранныеАвансыИДолги.Добавить();
		
		Если ВыборкаРезультатаЗапроса.Следующий() Тогда
						
			Если ВыборкаРезультатаЗапроса.СуммаУчета <= СуммаОсталосьРаспределить Тогда // сумма остатка меньше или равна чем осталось распределить
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаРезультатаЗапроса);
				
				СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ВыборкаРезультатаЗапроса.ДокументДата, Новый Структура("Валюта", ВыборкаРезультатаЗапроса.Договор.ВалютаРасчетов));
				
				Курс = ?(СтруктураПоВалюте.Курс = 0,1,СтруктураПоВалюте.Курс);
				Кратность = ?(СтруктураПоВалюте.Курс = 0,1,СтруктураПоВалюте.Кратность);
				НоваяСтрока.Курс = Курс;	
				СуммаОсталосьРаспределить = СуммаОсталосьРаспределить - ВыборкаРезультатаЗапроса.СуммаУчета;			
			Иначе // сумма остатка больше чем нужно распределить
						
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаРезультатаЗапроса);
				СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ВыборкаРезультатаЗапроса.ДокументДата, Новый Структура("Валюта", ВыборкаРезультатаЗапроса.Договор.ВалютаРасчетов));
				
				Курс = ?(СтруктураПоВалюте.Курс = 0,1,СтруктураПоВалюте.Курс);
				Кратность = ?(СтруктураПоВалюте.Курс = 0,1,СтруктураПоВалюте.Кратность);
					
				НоваяСтрока.СуммаРасчетов = Окр(СуммаОсталосьРаспределить/Курс * Кратность,2);
				НоваяСтрока.СуммаУчета    = СуммаОсталосьРаспределить;
				НоваяСтрока.Курс = Курс; 
				СуммаОсталосьРаспределить = 0;
				
			КонецЕсли;
			
		Иначе
			НоваяСтрока.Договор = ДоговорПоУмолчанию;
			НоваяСтрока.Курс = ?(
				СтруктураКурсВалютыДоговораПоУмолчанию.Курс = 0,
				1,
				СтруктураКурсВалютыДоговораПоУмолчанию.Курс
			);
			НоваяСтрока.Кратность = ?(
				СтруктураКурсВалютыДоговораПоУмолчанию.Кратность = 0,
				1,
				СтруктураКурсВалютыДоговораПоУмолчанию.Кратность
			);
					
			НоваяСтрока.СуммаРасчетов = Окр(СуммаОсталосьРаспределить/НоваяСтрока.Курс * НоваяСтрока.Кратность,2);
			НоваяСтрока.СуммаУчета    = СуммаОсталосьРаспределить;
			НоваяСтрока.ПризнакАванса = Истина;
			СуммаОсталосьРаспределить = 0;
			
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвтоматически(Команда)
	
	ЗаполнитьРасшифровкуПлатежа();
	//РассчитатьСуммаИтог();
	//ЗаполнитьАвансыИДолги();
	ЗаполнитьАвансыИДолги1();
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьАвансыИДолги1()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтобранныеАвансыИДолги.ПризнакАванса КАК ПризнакАванса,
	|	ОтобранныеАвансыИДолги.Договор КАК Договор,
	|	ОтобранныеАвансыИДолги.Документ КАК Документ,
	|	ВЫБОР
	|		КОГДА ОтобранныеАвансыИДолги.Заказ = НЕОПРЕДЕЛЕНО
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|		ИНАЧЕ ОтобранныеАвансыИДолги.Заказ
	|	КОНЕЦ КАК Заказ,
	|	ОтобранныеАвансыИДолги.СуммаРасчетов КАК СуммаРасчетов,
	|	ОтобранныеАвансыИДолги.СуммаУчета КАК СуммаУчета
	|ПОМЕСТИТЬ ТаблицаОтобранныеАвансыИДолги
	|ИЗ
	|	&ТаблицаОтобранныеАвансыИДолги КАК ОтобранныеАвансыИДолги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетыСПокупателямиОстатки.Документ КАК Документ,
	|	РасчетыСПокупателямиОстатки.Договор КАК Договор,
	|	РасчетыСПокупателямиОстатки.Заказ КАК Заказ,
	|	РасчетыСПокупателямиОстатки.ПризнакАванса КАК ПризнакАванса,
	|	СУММА(РасчетыСПокупателямиОстатки.СуммаОстаток) КАК СуммаУчета,
	|	СУММА(РасчетыСПокупателямиОстатки.СуммаВалОстаток) КАК СуммаРасчетов,
	|	РасчетыСПокупателямиОстатки.Документ.Дата КАК ДокументДата,
	|	КурсыВалютРасчетов.Курс КАК Курс,
	|	КурсыВалютРасчетов.Кратность КАК Кратность
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыСПоставщикамиОстатки.Договор КАК Договор,
	|		РасчетыСПоставщикамиОстатки.Документ КАК Документ,
	|		РасчетыСПоставщикамиОстатки.Заказ КАК Заказ,
	|		ВЫБОР
	|			КОГДА РасчетыСПоставщикамиОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ КАК ПризнакАванса,
	|		ВЫБОР
	|			КОГДА РасчетыСПоставщикамиОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|				ТОГДА -РасчетыСПоставщикамиОстатки.СуммаОстаток
	|			ИНАЧЕ РасчетыСПоставщикамиОстатки.СуммаОстаток
	|		КОНЕЦ КАК СуммаОстаток,
	|		ВЫБОР
	|			КОГДА РасчетыСПоставщикамиОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|				ТОГДА -РасчетыСПоставщикамиОстатки.СуммаВалОстаток
	|			ИНАЧЕ РасчетыСПоставщикамиОстатки.СуммаВалОстаток
	|		КОНЕЦ КАК СуммаВалОстаток
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщиками.Остатки(
	|				,
	|				Организация = &Организация
	|					И Контрагент = &Контрагент) КАК РасчетыСПоставщикамиОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОтобранныеАвансыИДолги.Договор,
	|		ОтобранныеАвансыИДолги.Документ,
	|		ОтобранныеАвансыИДолги.Заказ,
	|		ОтобранныеАвансыИДолги.ПризнакАванса,
	|		-ОтобранныеАвансыИДолги.СуммаУчета,
	|		-ОтобранныеАвансыИДолги.СуммаРасчетов
	|	ИЗ
	|		ТаблицаОтобранныеАвансыИДолги КАК ОтобранныеАвансыИДолги
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияДокументаРасчетыСПоставщиками.Договор,
	|		ДвиженияДокументаРасчетыСПоставщиками.Документ,
	|		ДвиженияДокументаРасчетыСПоставщиками.Заказ,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаРасчетыСПоставщиками.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаРасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ЕСТЬNULL(ДвиженияДокументаРасчетыСПоставщиками.Сумма, 0)
	|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаРасчетыСПоставщиками.Сумма, 0)
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаРасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ЕСТЬNULL(ДвиженияДокументаРасчетыСПоставщиками.СуммаВал, 0)
	|			ИНАЧЕ ЕСТЬNULL(ДвиженияДокументаРасчетыСПоставщиками.СуммаВал, 0)
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщиками КАК ДвиженияДокументаРасчетыСПоставщиками
	|	ГДЕ
	|		ДвиженияДокументаРасчетыСПоставщиками.Регистратор = &Ссылка
	|		И ДвиженияДокументаРасчетыСПоставщиками.Период <= &Период
	|		И ДвиженияДокументаРасчетыСПоставщиками.Организация = &Организация
	|		И ДвиженияДокументаРасчетыСПоставщиками.Контрагент = &Контрагент) КАК РасчетыСПокупателямиОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, ) КАК КурсыВалютРасчетов
	|		ПО РасчетыСПокупателямиОстатки.Договор.ВалютаРасчетов = КурсыВалютРасчетов.Валюта
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСПокупателямиОстатки.Документ,
	|	РасчетыСПокупателямиОстатки.Договор,
	|	РасчетыСПокупателямиОстатки.Заказ,
	|	РасчетыСПокупателямиОстатки.ПризнакАванса,
	|	РасчетыСПокупателямиОстатки.Документ.Дата,
	|	КурсыВалютРасчетов.Курс,
	|	КурсыВалютРасчетов.Кратность
	|
	|ИМЕЮЩИЕ
	|	(СУММА(РасчетыСПокупателямиОстатки.СуммаОстаток) > 0
	|		ИЛИ СУММА(РасчетыСПокупателямиОстатки.СуммаВалОстаток) > 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументДата";
	
	Запрос.УстановитьПараметр("Организация", Компания);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ТаблицаОтобранныеАвансыИДолги", СписокОтобранныеАвансыИДолги.Выгрузить());
	
	СписокАвансовДолгов.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры
